In [1]:
import pandas as pd
import numpy as np

import pymysql
from sqlalchemy import create_engine

from sklearn.metrics import confusion_matrix, accuracy_score, precision_score, recall_score, ConfusionMatrixDisplay
from sklearn.metrics import classification_report, f1_score, cohen_kappa_score

import getpass  # To get the password without showing the input

### Create a Python connection with SQL database

In [2]:
password = getpass.getpass()

········

In [3]:
connection_string = 'mysql+pymysql://root:'+password+'@localhost/sakila'
engine = create_engine(connection_string)

### How many distinct (different) actors' last names are there?

In [7]:
data = pd.read_sql_query('SELECT COUNT(DISTINCT last_name) FROM actor', engine)
data.head()

   COUNT(DISTINCT last_name)
0                        121

### Add an additional column day_type with values 'weekend' and 'workday' depending on the rental day of the week.

In [9]:
data = pd.read_sql_query('''SELECT *, CASE
WHEN WEEKDAY(rental_date) IN(1,2,3,4,5) then "workday"
WHEN WEEKDAY(rental_date) IN(6,7) then "weekend"
ELSE 'No status'
END AS 'day_type'
FROM rental''', engine)
data.head()

,rental_id,rental_date,inventory_id,customer_id,return_date,staff_id,last_update,day_type
0,1,2005-05-24 22:53:30,367,130,2005-05-26 22:04:30,1,2006-02-15 21:30:53,workday
1,2,2005-05-24 22:54:33,1525,459,2005-05-28 19:40:33,1,2006-02-15 21:30:53,workday
2,3,2005-05-24 23:03:39,1711,408,2005-06-01 22:12:39,1,2006-02-15 21:30:53,workday
3,4,2005-05-24 23:04:41,2452,333,2005-06-03 01:43:41,2,2006-02-15 21:30:53,workday
4,5,2005-05-24 23:05:21,2079,222,2005-06-02 04:33:21,1,2006-02-15 21:30:53,workday

### Get all films with ARMAGEDDON in the title.

In [25]:
data = pd.read_sql_query('''SELECT title from film WHERE title LIKE "%%ARMAGEDDON%%"''', engine)
data.head(10)

                   title
0        ARMAGEDDON LOST
1    LADYBUGS ARMAGEDDON
2       METAL ARMAGEDDON
3    MOSQUITO ARMAGEDDON
4  STAGECOACH ARMAGEDDON
5      STEERS ARMAGEDDON

### Get 10 the longest films.

In [19]:
data = pd.read_sql_query('''SELECT title, length FROM film
ORDER BY length DESC
LIMIT 10''', engine)
data.head(10)

                title  length
0      DARN FORRESTER     185
1        POND SEATTLE     185
2       CHICAGO NORTH     185
3       MUSCLE BRIGHT     185
4        WORST BANGER     185
5         GANGS PRIDE     185
6  SOLDIERS EVOLUTION     185
7           HOME PITY     185
8   SWEET BROTHERHOOD     185
9      CONTROL ANTHEM     185

### How many films include Behind the Scenes content?

In [23]:
data = pd.read_sql_query('''SELECT COUNT(film_id) FROM film
WHERE special_features LIKE "%%Behind the Scenes%%"''', engine)
data.head()

   COUNT(film_id)
0             538

### Which kind of movies (rating) have a mean duration of more than two hours?

In [22]:
data = pd.read_sql_query('''SELECT rating, round(AVG(length),2) AS mean_duration FROM film
GROUP BY rating HAVING mean_duration > 120''', engine)
data.head()

  rating  mean_duration
0  PG-13         120.44

### Rank films by length (filter out the rows that have nulls or 0s in length column). In your output, only select the columns title, length, and the rank.

In [21]:
data = pd.read_sql_query('''SELECT title, length, rank() OVER (PARTITION BY length ORDER BY title) as "rank"
FROM film WHERE (length <> 0) AND (length IS NOT NULL)''', engine)
data.head()

                 title  length  rank
0         ALIEN CENTER      46     1
1            IRON MOON      46     2
2        KWAI HOMEWARD      46     3
3     LABYRINTH LEAGUE      46     4
4  RIDGEMONT SUBMARINE      46     5